Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh543-v2.tmx
Source language: bo
Languages: en

source: སྒྲུབ་པ་པོ་ལ་དེར་རྗེས་སུ་གནང་ནས་རང་གི་གནས་སུ་རབ་ཏུ་ཞུགས་ཏེ།
en: When this has been granted, one should commence the sādhana.

source: མཆོད་པ་རྒྱ་ཆེན་པོ་བྱས་ནས་མར་གྱི་མར་མེ་སྟོང་རབ་ཏུ་སྦར་ནས་
en: One should give many offerings and light one thousand butter lamps.

source: ཞག་གསུམ་སྨྱུང་བ་བྱས་ལ། སེམས་ཅན་ཐམས་ཅད་ལ་བྱམས་པ་བསྐྱེད་ནས་བདག་ཉིད་ཕུལ་ཏེ་ལྡོང་རོས་བླངས་ནས། ཇི་སྲིད་གྲུབ་པ་རྣམ་གསུམ་ཐོབ་པ་དེ་སྲིད་དུ་བཟླས་པ་བྱས་ཏེ། དྲོ་བ་དང་དུ་བ་འཐུལ་བ་དང་འབར་བས་སྔར་གང་བསམས་པ་ཉིད་དུ་གྲུབ་པར་འགྱུར་ཏེ།
en: Having fasted for three nights while giving rise to loving kindness for all beings and commending oneself to the buddhas, one should take hold of the arsenic and recite the mantra until one has attained the threefold accomplishment, namely that the arsenic emits heat, smoke, and flames. Whatever one has previously thought of will be accomplished. {26.15}

source: དྲོ་བར་གྱུར་པས་དཔྲལ་བར་ཐིག་ལེ་བྱས་ན། ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། འབྱུང་པོ་ཐམས་ཅད་དང་། ཤ་ཟ་ལ་སོགས་པ་དང་། འཛམ་བུའི་གླིང་ན་གནས་པའི་སེམས་ཅན་བྲན་དུ་འགྱུར་ཞིང་གང་ཅུང་ཟད་ཐམས་ཅད་སྒྲུབ་པར་བྱེད་པར་འགྱུར་རོ། །
en: “If, without losing this accomplishment, one places a bindi on one’s forehead while the arsenic is emitting heat, all the gods, nāga s, yakṣa s, bhūtas, piśācas, and so forth, and all the beings dwelling in Jambūdvīpa, will become one’s servants attentive to orders.

source: ལོ་སྟོང་གི་བར་དུ་འཚོ་བར་འགྱུར་རོ། །
en: One will live one thousand years. {26.16}

source: དུ་བ་འཐུལ་བ་ལ་ནི་དཔྲལ་བར་ཐིག་ལེ་བྱས་ན་མི་སྣང་བར་འགྱུར་ཏེ།
en: “If one places the bindi while the arsenic is emitting smoke, one will become invisible.

source: གལ་ཏེ་འདོད་ན་ལྷ་རྣམས་ཀྱིས་ཀྱང་མི་མཐོང་བར་འགྱུར་རོ། །
en: If one wants, one will be invisible even to gods.

source: སྐད་ཅིག་ཐང་ཅིག་ཡུད་ཙམ་ལ་སྣང་ཞིང་ཡང་མི་སྣང་བར་འགྱུར་རོ། །
en: One can reappear and again disappear in a single instant.

source: མི་སྣང་བ་ཐམས་ཅད་ཀྱི་རྒྱལ་པོར་འགྱུར་ཞིང་ལོ་སུམ་སྟོང་གི་བར་དུ་འཚོ་བར་འགྱུར་རོ། །
en: One will become the king of all invisible beings and will live for three thousand years. {26.17}

source: འབར་བས་ནི་རིག་པ་འཛིན་པར་འགྱུར་ཏེ། གཡོག་འཁོར་དང་བཅས་པ་ནམ་མཁའ་ལ་འགྲོ་བར་འགྱུར་རོ། །
en: “[If one places the bindi while the arsenic] is emitting flames, one will become a vidyādhara and will be able to fly surrounded by a retinue.

source: རིག་པ་འཛིན་པའི་རྒྱལ་པོར་འགྱུར་ཏེ།
en: One will become the king of vidyādharas.

source: ལྷ་གཞོན་ནུའི་ལུས་སུ་འགྱུར་ཞིང་ལྷ་ཐམས་ཅད་ཀྱིས་ཀྱང་མི་ཐུལ་བར་འགྱུར་ན། རིག་པ་འཛིན་པ་རྣམས་ཀྱིས་ལྟ་སྨོས་ཀྱང་ཅི་དགོས་ཏེ།
en: One will obtain the body of a celestial youth that can’t be harmed even by gods, let alone vidyādharas.

source: བསྐལ་པར་ཡང་གནས་པར་འགྱུར་རོ། །
en: One will live for an eon,

source: དུས་བྱས་ནས་དགའ་ལྡན་གྱི་ལྷའི་རིས་སུ་སྐྱེ་བར་འགྱུར་རོ། །
en: and when one dies, one will be reborn among the Tuṣita gods. {26.18}

source: ཇི་སྟེ་མདུང་རྩེ་གསུམ་བསྒྲུབ་པར་འདོད་ན་ལྕགས་བཟང་པོ་ལས་བྱས་པའི་མདུང་རྩེ་གསུམ་པ་བྱས་ཏེ། ལོའི་བར་དུ་བཟླས་པ་བྱའོ། །
en: “The sādhana of the trident. “If one wants to perform this sādhana, one should make a trident from ‘flower-metal’ and recite the mantra for one year.

source: དེ་ནས་བྱེ་མའི་རང་བཞིན་གྱི་མཆོད་རྟེན་ཁྲུ་གང་ཙམ་གྱི་ཚད་བྱས་ཏེ། །
en: One should then build from sand a caitya the size of one cubit

source: དེ་ལ་མཆོད་པ་ཆེན་པོ་བྱ་ཞིང་གཏོར་མ་རྒྱ་ཆེན་པོ་བཏང་ལ་ལག་པ་གཡས་པས་མདུང་རྩེ་གསུམ་པ་བླངས་ལ་སྐྱིལ་མོ་ཀྲུང་བཅས་ནས་ཇི་སྲིད་དུ་སྤྲོས་པ་ན། འོད་ཟེར་སྟོང་བྱུང་བ་དེའི་བར་དུ་བཟླས་པ་བྱས་ན་སྐབས་འདིར་དབང་ཕྱུག་ཆེན་པོ་ལ་སོགས་པ་ལྷ་རྣམས་འབྱུང་བར་འགྱུར་རོ། །
en: and worship it with many offerings, including a large bali. Holding the trident in one’s right hand, one should recite the mantra while sitting in a cross-legged posture until the trident starts sparkling, emitting thousands of light rays. Subsequently the gods will arrive, headed by Maheśvara.

source: རིག་པ་འཛིན་པ་ཐམས་ཅད་མེ་ཏོག་གི་ཆར་འབེབས་པ་དང་ལྷ་ཐམས་ཅད་ཀྱང་མེ་ཏོག་གི་ཆར་རབ་ཏུ་འབེབས་པར་འགྱུར་རོ། །
en: All the vidyādharas will rain flowers.

source: དེ་ནས་དེ་ཐམས་ཅད་ཀྱིས་ཡོངས་སུ་བསྐོར་ནས། གང་དག་གིས་མཐོང་བ་དང་གང་མཐོང་བ་དེ་དང་ལྷན་ཅིག་ཏུ་ནམ་མཁའ་ལ་འགྲོ་བར་འགྱུར།
en: Then, surrounded by them, one will fly up together with all those whom one sees and those that see oneself.

source: རིག་པ་འཛིན་པའི་རྒྱལ་པོ་མིག་གསུམ་པར་འགྱུར་ཏེ། དབང་ཕྱུག་ཆེན་པོ་གཉིས་པ་དང་འདྲ་བའོ། །
en: Having three eyes, one will become like a second Maheśvara,

source: རིག་པ་འཛིན་པ་ཐམས་ཅད་ཀྱིས་ཕྱག་བྱས་ཤིང་། བསྐལ་པ་ཆེན་པོར་གནས་པར་འགྱུར་ལ། བལྟས་པ་ཙམ་གྱིས་གདུག་པའི་སེམས་དང་ལྡན་པ་རྣམས་ལྟུང་བར་འགྱུར་རོ། །
en: will be saluted by all the vidyādharas, and will live for one great eon. One will destroy evil-minded beings merely by looking at them.

source: ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་གང་གིས་ཀྱང་མི་ཚུགས་པར་འགྱུར་ན། རིག་པ་འཛིན་པ་རྣམས་ཀྱིས་ལྟ་སྨོས་ཀྱང་ཅི་དགོས།
en: No one in the world will be able to harm one, not even in the realm of gods, let alone among the vidyādharas.

source: ཤི་འཕོས་ནས་བདེ་བ་ཅན་དུ་སྐྱེ་བར་འགྱུར་རོ། །
en: When one dies, one will be reborn in Sukhāvatī. {26.19}

source: ཇི་སྟེ་རོ་ལངས་བསྒྲུབ་པར་འདོད་ན། ཡན་ལག་རྨ་མེད་པའི་སྐྱེས་བུའི་རོ་བླངས་ཏེ། སེང་ལྡེང་གི་ཕུར་བུ་བཞེས་བཏབ་ལ་བྲང་གི་སྟེང་དུ་རིན་པོ་ཆེའི་ཕྱེ་མས་གཏོར་ཅིང་མཆོད་ན།
en: “The sādhana of the vetāla. “If one wants to perform this sādhana, one should procure an uninjured human corpse, secure its chest with four stakes of khadira wood and, sitting on it, offer into the fire powdered jewels.

source: དེའི་ལྕེའི་རྩེ་མོ་ལ་ནོར་བུ་རིན་པོ་ཆེ་སྣང་བར་འགྱུར་ཏེ། དེ་བླངས་ན་རིག་པ་འཛིན་པའི་འཁོར་ལོས་སྒྱུར་བར་འགྱུར་རོ། །
en: A wish fulfilling gem will then appear at the tip of the corpse’s tongue. If one seizes it, one will become a monarch of the vidyādharas.

source: མཚོན་གང་དག་ཡིད་ལ་བསམས་པ་ཙམ་གྱིས་དེ་དག་འབྱུང་བར་འགྱུར་རོ། །
en: Whatever weapons one thinks of, they will materialize by the power of mind alone.

source: འོད་དཔག་ཚད་བརྒྱ་ཙམ་དུ་སྣང་བར་འགྱུར་རོ། །
en: One will radiate light for a distance of one hundred leagues

source: འདོད་ན་དུས་བྱེད་པར་ཡང་འགྱུར་རོ། །
en: and will be able to choose the time of one’s death

source: གང་དུ་འདོད་པ་དེར་འགྲོ་བར་འགྱུར་རོ། །
en: and to go wherever one pleases.

source: འཇིག་རྟེན་གྱི་ཁམས་གཞན་དག་ཏུ་ཡང་རིག་པ་འཛིན་པའི་འཁོར་ལོས་སྒྱུར་བར་ཡང་འགྱུར་རོ། །
en: Also, in another world, one will be a monarch of the vidyādharas.

source: ཤི་འཕོས་ནས་ཀྱང་དྲི་མ་མེད་པའི་འཇིག་རྟེན་གྱི་ཁམས་སུ་སྐྱེ་བར་འགྱུར་རོ། །
en: When one dies, one will be reborn in the Vimala world. {26.20}

source: རོ་ལངས་གཉིས་པ་སྒྲུབ་པ་ནི་རྨ་མེད་པའི་ལུས་ཀྱི་རོ་བླངས་ལ། རྒྱ་ཤུག་གི་ཤིང་གི་ཕུར་བུས་བཏབ་ལ་དེའི་ཁར་ལྕགས་ཀྱི་ཕྱེ་མས་གཏོར་ཞིང་བྱིན་ན
en: “The second sādhana of the vetāla. “One should procure an uninjured corpse, nail it down with stakes of jujube wood, and offer into its mouth a homa of iron filings.

source: དེའི་ལྕེ་འབྱིན་པར་འགྱུར་ཏེ། དེ་བཅད་ན་གཡོག་འཁོར་བརྒྱ་དང་བཅས་ཏེ་ནམ་མཁའ་ལ་འགྲོ་བར་འགྱུར།
en: The corpse’s tongue will move out. If one cuts it off, one will fly up surrounded by a retinue of one hundred.

source: བར་གྱི་བསྐལ་པར་གནས་པར་འགྱུར། རི་རབ་ཀྱི་རྩེ་མོར་རྩེ་ཞིང་དགའ་བར་འགྱུར།
en: One will live for one intermediate eon, playing and enjoying oneself on the top of Mount Sumeru.

source: གང་གི་ཚེ་འཆི་བ་དེའི་ཚེ་ཕྱོགས་གཅིག་གི་རྒྱལ་པོར་འགྱུར་རོ། །
en: After death, one will become a king of a province. {26.21}

source: ཇི་སྟེ་ལྕགས་ཀྱུ་བསྒྲུབ་པར་འདོད་ན། རྩྭ་ཀུ་ཤའི་རང་བཞིན་གྱི་ལྕགས་ཀྱུ་བྱ་སྟེ། ཐབ་མོ་བ་མདོག་ནག་པོའི་ལག་པའི་མཐིལ་གྱིས་བའི་རྣམ་ལྔས་བཀྲུས་ཏེ།
en: “The sādhana of the goad. “If one wants to perform this sādhana, one should make a goad out of kuśa grass, rinse it with the five products of a cow, and fast for one night.

source: མཚན་མོ་གཅིག་སྨྱུང་བ་བྱས་ནས་ལྕགས་ཀྱུ་ཁྲུ་གང་གི་ཚད་དུ་བྱས་ལ། མཆོད་པ་རྒྱ་ཆེན་པོ་བྱས་ནས་ཕྱག་ན་རྡོ་རྗེ་ལ་མར་གྱི་མར་མེ་བརྒྱ་སྦར་བར་བྱའོ། །
en: The handle of the goad should be one cubit long. One should make bountiful offerings to Vajrapāṇi and light one hundred butter lamps.

source: རྡོ་རྗེ་ལྕགས་ཀྱུ་དང་བདག་ཉིད་ལ་གདུགས་དཀར་པོས་བསྲུང་བར་བྱའོ། །
en: One should also make a vajra. In this way one will be protected by Sitātapatra.

source: གཟི་བརྗིད་ཕུང་པོས་ནི་དཀྱིལ་འཁོར་བཅིང་བར་བྱའོ། །
en: Tejorāśi should be employed in creating the maṇḍala enclosure on the ground.

source: ཕུར་བུ་ལ་ལན་བདུན་མངོན་པར་བསྔགས་པ་བྱས་ཏེ། ཕྱོགས་བཞིར་གཏོར་ལ་ཕུར་བུས་བཏབ་ན་འོག་ཏུ་བཅིང་བ་བྱས་ཤིང་གནས་ཡོངས་སུ་གཟུང་བ་བྱས་པར་ཡང་འགྱུར་རོ། །
en: One should incant the stakes seven times and drive them into the ground on the four sides. Then one should secure the location and build a fence. {26.22}

source: དེ་ནས་ཐུན་གཉིས་པ་ལ་རྩེ་གཅིག་པའི་ཡིད་ཀྱིས་སྐྱིལ་མོ་ཀྲུང་བཅས་ལ། ལྕགས་ཀྱུ་ལ་མེ་ཏོག་དང་དྲི་དང་བདུག་པས་མཆོད་ན་དེ་བསྲུང་བ་བྱས་པ་ཡིན་ནོ། །
en: “Then, during the second watch, one should sit cross-legged and, with a focused mind, offer perfume, flowers, and incense to the goad—this is the rite of protection.

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ནས། སྐབས་འདིར་ལྕགས་ཀྱུ་ལག་པས་བཟུང་ནས་ཇི་སྲིད་དུ་དམྱལ་བའི་སེམས་ཅན་རྣམས་འཚེ་བ་ཉེ་བར་ཞི་བའི་བར་དུ་བཟླས་ལ།
en: Having bowed to all the buddhas and bodhisattvas, one should take the goad into one’s hand and recite the mantra until, as the result, the pain of the hell beings and the gods is pacified.

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ན་ནམ་མཁའ་ལ་འགྲོ་བར་འགྱུར་རོ། །
en: If one then bows to all the buddhas and bodhisattvas, one will fly up

source: རིག་པ་འཛིན་པའི་རྒྱལ་པོ་འགྲོ་བ་ལ་ཐོགས་པ་མེད་པ་ལྕགས་ཀྱུ་ལག་ན་ཐོགས་པ་ལྷ་ཐམས་ཅད་དང་ཀླུ་དང་གནོད་སྦྱིན་ལ་སོགས་པ་ཡང་ཐག་རིང་པོ་ཉིད་ནས་མཐོང་ན་ཕྱག་འཚལ་བར་བྱེད་དོ། །
en: as a king of vidyādharas with a goad in one’s hand and without being obstructed. All the gods, nāga s, yakṣa s, and so forth, seeing one from afar, will bow.

source: གང་གི་ཚེ་འཆི་བ་དེའི་ཚེ་ཕྱག་ན་རྡོ་རྗེའི་གནས་སུ་འགྲོ་ཞིང་ཕྱག་ན་རྡོ་རྗེ་མཐོང་བར་འགྱུར་རོ། །
en: and when one dies, one will be reborn in the Vajra realm. One will behold Vajrapāṇi there. {26.23}

source: གལ་ཏེ་རས་རིས་སྒྲུབ་པར་གྱུར་ན། དེ་འབར་བ་ན་རིག་པ་འཛིན་པར་འགྱུར།
en: “If one uses the painting as the object of the sādhana, one will become a vidyādhara once the painting emits light.

source: ཆོ་ག་གང་བསྒྲུབ་པར་འདོད་ཀྱང་དེའི་སྔགས་ཀྱི་མིང་བཟུང་ལ་འབུམ་བཟླ་ཞིང་།
en: Whatever rite one wants to accomplish, one should recite the mantra of this rite one hundred thousand times, including in the mantra the target’s name.

source: དེ་ནས་ནུབ་གཅིག་སྨྱུང་བ་བྱས་ཏེ། མཆོད་པ་རྒྱ་ཆེན་པོ་བྱས་ལ། ཤིང་ཨརྐའི་མེ་རབ་ཏུ་སྦར་ཏེ་ཏིལ་དག་ལ་ཞོ་དང་མར་གྱིས་བཏགས་པའི་སྦྱིན་སྲེག་སྟོང་རྩ་བརྒྱད་བྱས་ན།
en: In the end, after one night’s fast, one should offer a large pūjā, light a fire with sticks of the crown flower plant, and offer into it one thousand and eight oblations of sesame seeds smeared with curds, honey, and ghee.

source: སྦྱིན་སྲེག་གི་མཐར་འོངས་ནས་ནོར་གང་འདོད་པ་དེ་སྟེར་བར་འགྱུར་ཞིང་མངག་གཞུག་པ་དབང་དུ་བྱེད་པ་བཞིན་དུ་ཉེ་བར་གནས་པར་འགྱུར་རོ། །
en: At the end of the homa, [the target] will arrive and give whatever wealth one may desire. He will remain enthralled and attentive to orders. {26.24}

source: ཇི་སྟེ་དབང་ཕྱུག་ཆེན་པོ་དབང་དུ་བྱེད་པར་འདོད་ན། དབང་ཕྱུག་ཆེན་པོ་ལ་མཆོད་པ་རྒྱ་ཆེན་པོ་བྱས་ལ།
en: “The sādhana of Maheśvara. “If one wants to enthrall Maheśvara, one should worship him in his benevolent ( dakṣiṇa ) form with bountiful offerings.

source: ལྷོ་ཕྱོགས་སུ་ཡུད་ཙམ་གྱིས་ཤིང་ཨརྐའི་མེ་རབ་ཏུ་སྦར་ལ་སྦྱིན་སྲེག་སྟོང་རྩ་བརྒྱད་བྱས་པ་ན།
en: One should light a fire with sticks of the crown flower plant and offer into it one thousand and eight homas.

source: ཧ་ཧ་ཞེས་པའི་སྒྲ་བྱུང་བར་གྱུར་ན་འཇིགས་པར་མི་བྱ།
en: The sound ‘ha ha’ will be heard; one should not be afraid.

source: དེ་ནས་དེ་འོང་བར་འགྱུར་ཏེ། བདག་གིས་ཅི་ཞིག་བྱ་ཞེས་སྨྲ་བར་འགྱུར་རོ། །
en: Maheśvara will arrive and ask, ‘What should I do?’

source: དབང་ཕྱུག་ཆེན་པོའི་རིག་པ་ཐམས་ཅད་བདག་ལ་གྲུབ་པར་གྱུར་ཅིག་ཅེས་སྨྲས་པ་དང་།
en: One should reply, ‘May all the vidyā s of Maheśvara be accomplished by me.’

source: མཆོག་གང་འདོད་པ་དེ་སྟེར་བར་འགྱུར་ཏེ། དེ་བཞིན་དུ་གྱུར་ཅིག་ཅེས་བྱས་ནས་མི་སྣང་བར་འགྱུར་རོ། །
en: Maheśvara will grant whatever boon one may wish for. Saying, ‘May it be so,’ he will disappear. {26.25}

source: དེ་བཞིན་དུ་ཁྱབ་འཇུག་དང་ཚངས་པ་ལ་སོགས་པ་གང་ཡང་འགུགས་པར་འགྱུར་ཏེ།
en: “Similarly, one can summon Viṣṇu, Brahmā, and so forth.

source: མཆོག་གང་འདོད་པ་དེའང་འདི་བཞིན་ཏེ།
en: Whatever boon one wishes for, one should perform the rite accordingly.

source: ཆོ་ག་འདི་བཞིན་དུ་བྱས་ལ་ལེགས་པར་བསྲུང་བ་ཡང་བྱའོ། །
en: This should be done by someone who has performed the protection rite. {26.26}

source: ཅི་སྟེ་གནོད་སྦྱིན་མོ་དགུག་པར་འདོད་ན། དེའི་མིང་བཟུང་ལ་ཞག་བདུན་དུ་ཤིང་མྱ་ངན་མེད་ཀྱི་མེ་ཏོག་གིས་སྦྱིན་སྲེག་བྱས་ན་འོང་ཞིང་མཆོག་སྟེར་བར་བྱེད་དོ། །
en: “The sādhana of the yakṣiṇī. “If one wants to summon a yakṣiṇī, one should offer, while saying her name, oblations of aśoka flowers for seven days. She will arrive and grant a boon.

source: ཞག་བདུན་གྱིས་མ་དང་སྲིང་མོ་དང་ཆུང་མ་གང་འདོད་པ་དེའི་ཆ་བྱད་དུ་ངེས་པར་འོང་བར་འགྱུར་རོ། །
en: She will certainly arrive on the seventh day. According to one’s wish, she will become one’s mother, sister, or wife.

source: ཇི་སྟེ་མི་འོང་ན་མགོ་འགས་པར་འགྱུར་རོ། །
en: If she subsequently fails to arrive, her head will split.

source: ཀླུ་མོ་དབང་དུ་བྱེད་པར་འདོད་ན་ཀླུ་ཤིང་གི་མེ་ཏོག་གིས་ཆོ་ག་འདི་བཞིན་དུ་བྱའོ། །
en: If one wants to summon a nāginī instead, one should follow exactly the same procedure, but use, [instead of aśoka], flowers of cobra’s saffron. {26.27}

source: སྲིན་མོ་དགུག་པར་འདོད་ན། ཟླ་བ་གསུམ་དུ་ཞོ་དང་འབྲས་ཆན་གྱི་སྦྱིན་སྲེག་བྱའོ། །
en: “The sādhana of the yakṣa. “If one wants to summon a yakṣa , one should offer a homa of curds and cooked rice for three months.

source: སྦྱིན་སྲེག་གི་མཐར་ཞག་གཅིག་སྨྱུང་བ་བྱས་ལ། བཅོམ་ལྡན་འདས་ལ་མཆོད་ཅིང་གནོད་སྦྱིན་ལ་གཏོར་མ་ཆན་རྣམས་སྦྱིན་པར་བྱས་ཤིང་གནོད་སྦྱིན་དགུག་པར་བྱའོ་ཞེས་ཡིད་ལ་བྱེད་ཅིང་། །ཨ་མྲའི་ཤིང་གི་ཡམ་ཤིང་ཞོ་དང་སྦྲང་རྩི་དང་མར་གྱིས་བཏགས་པ་སྟོང་རྩ་བརྒྱད་སྦྱིན་སྲེག་བྱས་ན
en: At the end of this period, one should fast for one night and then offer a large pūjā to the Blessed One, and also make a bali offering of rice porridge to the yakṣa s. In one’s mind, one should resolve, ‘I am going to summon the yakṣa s,’ and offer into the fire one thousand and eight sticks of the banyan tree smeared with curds, honey, and ghee.

source: སྐབས་འདིར་ལུས་ངན་པོ་ལ་སོགས་པའི་གནོད་སྦྱིན་འོང་བར་འགྱུར་ལ།
en: Subsequently, the yakṣa s, including Kubera, will arrive. {26.28}

source: དེ་དག་ལ་ཤིང་ཨརྐའི་མེ་ཏོག་གི་མཆོད་ཡོན་བྱིན་ན་དེ་དག་ཅི་ཞིག་བྱ་ཞེས་སྨྲ་བར་འགྱུར་རོ། །
en: “One should welcome them with an offering of red flowers.

source: དེས་བརྗོད་པར་བྱ་བ་ནི་ཉིན་རེ་ཞིང་གནོད་སྦྱིན་ལུང་བཞིན་དུ་བྱེད་པ་དགོས་སོ་ཞེས་བརྗོད་པར་བྱ་སྟེ། དེས་གནོད་སྦྱིན་རེ་རེ་སྟེར་བར་འགྱུར་རོ། །
en: They will say, ‘What can we do for you?’ and should be told in reply, ‘Send me a different yakṣa every single day who will carry out my orders.’

source: དེས་ལུང་བསྒོ་བར་བྱ་བ་ནི་དཔག་ཚད་བརྒྱ་ནས་བུད་མེད་རྣམས་འདིར་འོང་བར་གྱིས་ལ་ཐོ་རངས་དེ་ཉིད་དུ་ཁྱེར་ཅིག་ཅེས་པ་དང་འཁོར་བརྒྱ་ལ་ཡང་འབྲས་ཆན་བྱིན་ཅིག་ཅེས་བརྗོད་ནརྒྱབ་ཏུ་ཁུར་ནས་གང་དུ་འདོད་པ་དེར་འགྲོ་ཞིང་ཁྱེར་བར་འགྱུར་རོ། །
en: They will then provide the yakṣa s, one at a time. One should issue orders to them. They can procure a woman, even if she is one hundred leagues away. In the morning, they will take her back to the place where she belongs. They will provide refreshments also for one’s retinue of one hundred. One can travel wherever one wants, mounted on the back [of a yakṣa ]. One will be brought back [in the same manner].

source: ལུང་སྩལ་བ་ཐམས་ཅད་བྱེད་པར་འགྱུར་རོ། །
en: They will do whatever they are commanded. {26.29}

source: ཅི་སྟེ་ཕྱག་ན་རྡོ་རྗེ་བསྒྲུབ་པར་འདོད་ན་བཞི་འགྱུར་དང་བདུན་འགྱུར་གྱི་སྔོན་དུ་བསྙེན་པ་བྱས་ལ།
en: “The sādhana of Vajrapāṇi. “If one wants to perform this sādhana, one should do the preliminary practice either four or seven times.

source: ཆོ་འཕྲུལ་གྱི་ཟླ་བ་ཕྱེད་པོ་མ་ལུས་པ་ལ་རབ་ཏུ་རྒྱ་ཆེ་བའི་མཆོད་པ་བྱས་ལ་ཇི་སྲིད་ཟླ་བ་ཉ་བའི་བར་དུ་སྟེ།
en: One should then offer a complete worship with bountiful offerings during the prātihāra bright fortnight right until the full moon.

source: ཟླ་བ་ཉ་བའི་བར་དུ་མཆོད་པ་བྱས་ལ་དགེ་སློང་གི་དགེ་འདུན་ཁྱད་པར་ཅན་དག་ལ་བཤོས་གསོལ་ནས།
en: When the full moon pūjā is thus completed, one should feed the monks and all those categorized as saṅgha.

source: འཕགས་པ་རྡོ་རྗེ་འཛིན་ཁོ་ན་ལ་རྗེས་སུ་ཡི་རང་བར་བྱེད་དུ་གཞུག་གོ། །
en: To propitiate the noble Vajradhara,

source: དེ་ནས་མཆོད་པ་རྒྱ་ཆེན་པོ་བྱས་ནས་དང་པོའི་ཐུན་འདས་ཏེ་གཉིས་པའི་ཐུན་ལ་སྐྱིལ་མོ་ཀྲུང་བཅས་ཏེ་འདུག་ལ། སེམས་རྩེ་གཅིག་པས་རྡོ་རྗེ་འཛིན་བལྟ་བར་བྱའོ། །ཞེས་སེམས་ལ་ཀུན་ཏུ་བརྟགས་ཏེ།
en: one should offer another big pūjā and, when the first watch of the night has passed and the second has set in, one should sit in a cross-legged position and, focused one-pointedly, resolve in one’s mind, ‘I will now behold Vajradhara .’

source: གུ་གུལ་གྱི་རིལ་བུ་རྒྱ་ཤུག་གི་འབྲས་བུའི་ཚད་ཙམ་གྱི་མཚན་མོ་ཐུན་གཅིག་ཏུ་སྦྱིན་སྲེག་བྱའོ། །
en: One should then offer into the fire [oblations of] bdellium pills, the size of kernels of the jujube fruit, throughout one watch of the night.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཡུལ་བསྐྱོད་པར་འགྱུར་ཞིང་། ས་འགུལ་བ་དང་སྤྲིན་གྱི་སྒྲ་སྒྲོགས་པར་འགྱུར་བ་དང་། རིག་པ་འཛིན་པ་ཐམས་ཅད་མེ་ཏོག་གི་ཆར་རབ་ཏུ་འབེབས་པར་འགྱུར་རོ། །
en: At that time the garlands and chaplets of the Blessed One will move, the earth will shake, and thunder will roll through the clouds. All the vidyādharas will rain flowers.

source: སྐབས་འདིར་བཅོམ་ལྡན་འདས་ཕྱག་ན་རྡོ་རྗེ་རིག་པ་ཐམས་ཅད་ཀྱིས་ཡོངས་སུ་བསྐོར་བ་དང་རིག་པ་མཆོག་ལ་སོགས་པའི་རིག་པའི་རྒྱལ་པོས་ཡོངས་སུ་བསྐོར་བ་བྱོན་པར་འགྱུར་རོ། །
en: While [all this is happening,] Blessed Vajrapāṇi will arrive surrounded by all the vidyā s, headed by the most prominent [among them]; by the vidyādhara kings;

source: ལྷ་ཐམས་ཅད་དང་། ཀླུ་ཐམས་ཅད་དང་། གནོད་སྦྱིན་ཐམས་ཅད་དང་། དྲི་ཟ་དང་མིའམ་ཅིས་བྱང་ཆུབ་སེམས་དཔའ་ཡོངས་སུ་བསྐོར་བ་བྱོན་པར་འགྱུར་རོ། །
en: and by all the gods, nāga s, yakṣa s, gandharvas, kinnaras, and bodhisattvas. {26.30}

source: དེའི་མོད་ལ་དམྱལ་བའི་སེམས་ཅན་རྣམས་ཀྱི་ཤིན་ཏུ་དྲག་པའི་ཚོར་བའི་སྡུག་བསྔལ་ཉེ་བར་ཞི་བར་འགྱུར་རོ། །
en: “At that moment, the acute suffering of hell beings will cease.

source: དྲིའི་ཆུས་མཆོད་ཡོན་དབུལ་ཞིང་ཕྱག་འཚལ་ཏེ་འདུག་པར་བྱའོ། །
en: One should welcome Vajrapāṇi with scented water [for the feet], prostrate to him, and stand up.

source: དེ་ནས་རྡོ་རྗེ་འཛིན་གྱིས་གསུངས་པ་ནི་མཆོག་ཅི་ཞིག་སྦྱིན་པར་བྱ། རིག་པ་འཛིན་པའི་འཁོར་ལོས་སྒྱུར་བ་ཉིད་དམ་ས་འོག་ཏུ་འགྲོ་བའམ་རྒྱལ་སྲིད་དམ་མི་སྣང་བར་འགྲོ་བའམ་གང་འདོད་པ་དེ་ཉིད་བཅོམ་ལྡན་འདས་ལས་ཐོབ་པར་འགྱུར་རོ། །
en: Vajradhara will then ask, ‘What boon shall I give you?’ One can obtain from the Blessed One whatever one wishes for—a universal supremacy over the vidyādharas, the ability to find and enter the passages leading into the subterranean paradises, a kingdom, or the ability to disappear at will.

source: གང་འདོད་པའི་རིག་པ་འཛིན་པའི་འཁོར་ལོས་སྒྱུར་བ་ཉིད་དང་རིག་པ་འཛིན་པ་ཐམས་ཅད་ཀྱི་འཁོར་ལོས་སྒྱུར་བ་རྡོ་རྗེའི་སྐུ་དང་། ཕྱག་ན་རྡོ་རྗེ་དང་འདྲ་བ་དང་བསམས་པ་ཙམ་གྱིས་མཚན་མ་ཐམས་ཅད་འབྱུང་བར་འགྱུར་རོ། །
en: If one wishes, one may become a monarch of the vidyādharas with a vajra body similar to Vajrapāṇi’s. One may procure any article by merely thinking of it.

source: བསྐལ་པ་ཆེན་པོར་གནས་པར་འགྱུར་རོ། །
en: One will remain for one great eon,

source: གང་གི་ཚེ་འཛིན་པ་དེའི་ཚེ་རྡོ་རྗེའི་གནས་སུ་འགྲོ་བར་འགྱུར་རོ། །
en: and when one dies, one will be reborn in the Vajra realm. {26.31}

source: རིག་པ་འཛིན་པ་གཞན་དག་གི་ཡང་ཆོ་ག་འདི་བཞིན་ཏེ། མདོར་ན་ཕྱག་ན་རྡོ་རྗེའི་ཆོ་ག་གང་ཡིན་པ་དང་། འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་ཆོ་ག་གང་ཡིན་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པའི་ཆོ་ག་གང་ཡིན་པ་དང་། ཚངས་པའི་ཆོ་ག་གང་ཡིན་པ་དང་། དབང་ཕྱུག་ཆེན་པོའི་ཆོ་ག་གང་ཡིན་པ་དང་། མདོར་ན་འཇིག་རྟེན་དང་འཇིག་རྟེན་ལས་འདས་པའི་སྒྲུབ་པ་གང་ཡིན་པ་དེ་དག་ཀྱང་འདི་ཉིད་ཀྱིས་སྒྲུབ་པ་བྱས་ན་འགྲུབ་པར་འགྱུར་རོ། །
en: “In short, the same procedure may also be used for other vidyādharas. The rites that are found in the ritual lore of Vajrapāṇi or Avalokiteśvara, those that have been taught by the Blessed One, those found in the ritual lore of Brahmā or Maheśvara—in short, the sādhanas given previously—will succeed in all the mundane and supramundane rites.

source: སྔགས་གང་གིས་སྒྲུབ་པ་བྱས་ཀྱང་མ་གྲུབ་པ་ནི་འདིས་ལུས་ལ་བཟླས་པ་བྱས་ན། ནུབ་བདུན་གྱིས་ངེས་པར་མཐོང་བ་སྦྱིན་པར་བྱེད་དོ། །
en: The great mantras, if they are not thus made effective, will not succeed. If, however, they are recited as part of this procedure, [the vidyādhara] will make his appearance within seven nights.

source: ཇི་སྟེ་མི་སྦྱིན་ན་ནི་རྣམ་པར་ཉམས་པར་འགྱུར་རོ། །
en: If he does not, he will perish.

source: དབང་ཕྱུག་ཆེན་པོ་ལ་སོགས་པའི་ལྷའི་མདུན་དུ་གལ་ཏེ་ཟློས་པ་བྱེད་ན་ནུབ་བདུན་གྱི་ནང་དུ་མཐོང་བ་སྦྱིན་པར་བྱེད་དོ། །
en: If one recites the mantra before the gods headed by Maheśvara, [the vidyādhara] will make his appearance within seven nights.

source: གལ་ཏེ་སྦྱིན་པར་མི་བྱེད་ན་མགོ་ཚལ་པ་བདུན་ཕྲག་གསུམ་དུ་འགས་པར་འགྱུར་རོ། །
en: If he does not, his head will split into twenty-one parts. {26.32}

source: ཟླ་བ་དང་ཉི་མ་གཟས་ཟིན་པ་ན་མར་དང་ཤུ་དག་དང་མིག་སྨན་དང་དག་བྱེད་དང་སོ་ཤིང་དང་མཆོད་ཕྱིར་ཐོགས་དང་བ་བླ་དང་ལྡོང་རོས་ལ་སོགས་པ་བསྒྲུབ་པར་བྱའོ། །
en: “[The sādhana of substances, etc.] “Ghee, sweet flag, collyrium, sacrificial grass, a wooden staff, the sacred thread, yellow or red arsenic, and so forth can be magically empowered during a lunar or solar eclipse.

source: ཇི་སྟེ་རྫས་རྣམས་བསྒྲུབ་པར་འདོད་ན། ལྡོང་རོས་བླངས་ཏེ་མིའི་འོ་མ་དང་སྦྱར་བ་བྱས་ལ་རིལ་བུ་ལྔར་བྱ་ཞིང་།
en: If one wants to perform the sādhana of the substances, one should take some red arsenic, grind it with human milk, and prepare five pills.

source: ཨ་ག་རུའི་སྣོད་ཁ་སྦྱར་གྱི་ནང་དུ་བཅུག་ཅིང་ཡུངས་ཀར་དང་ལྷན་ཅིག་བསྒྲུབ་པར་བྱའོ། །ཟླ་བ་དང་ཉི་མ་གཟས་ཟིན་པའི་དུས་སུ་གཏོར་མའི་ཆོ་ག་བྱས་ཏེ།
en: One should place them in a box containing agalloch and imbue them with power ( sādhayet ) during a lunar or solar eclipse by adding white mustard seeds. One should then offer a bali.

source: གང་གི་ཚེ་ཡུངས་ཀར་ཙི་ཏི་ཙི་ཏི་ཞེས་སྒྲ་འདོན་པ་དེའི་ཚེ་གྲུབ་པ་དང་པོ་ཡིན་ཏེ། སྐྱེ་བོ་ཐམས་ཅད་དབང་དུ་འགྱུར་ལ་དེའི་ཚེ་འདི་ཐམས་ཅད་དབང་དུ་བྱེད་པར་འགྱུར་ཏེ། གང་སྨྲས་པ་དེ་ཐམས་ཅད་བྱེད་དོ། །
en: When the mustard seeds make a hissing sound, the first accomplishment has been obtained. With it, one can enthrall all people and accomplish all worldly aims. The [pills’ spirit] will do whatever it is ordered to.

source: ཇི་སྟེ་དུ་བ་འཐུལ་བར་བྱེད་ན་མི་སྣང་བར་བྱེད་པ་ཐམས་ཅད་ཀྱི་རྒྱལ་པོར་འགྱུར་རོ། །
en: If the pills emit smoke, one will become the king of all those able to disappear at will

source: བར་གྱི་བསྐལ་པར་འཚོ་བར་འགྱུར་རོ། །
en: and will live for one intermediate eon.

source: གང་གི་ཚེ་འབར་བར་གྱུར་པ་དེའི་ཚེ་ནི་ལྷ་གཞོན་ནུའི་གཟུགས་སུ་འགྱུར་ཞིང་། ཉི་མ་འཆར་ཀའི་གཟི་བརྗིད་དང་ལྡན་ལ་རིག་པ་འཛིན་པའི་རྒྱལ་པོར་འགྱུར།
en: If the pills emit light, one will obtain the youthful body of a god and the splendor of a newly risen sun. One will become the king of vidyārāja s

source: བསྐལ་པ་ཆེན་པོར་འཚོ་བར་འགྱུར།
en: and will live for one great eon.

source: དེ་བཞིན་དུ་གི་ཝང་དང་བ་བླ་ལ་སོགས་པ་ལའང་བསྒྲུབ་པར་བྱའོ། །
en: This is the way to perform the sādhana of bezoar, yellow arsenic, and other substances. {26.33}

source: ཅི་སྟེ་མིག་སྨན་བསྒྲུབ་པར་འདོད་ན། ལིག་བུ་མིག་དང་ཨུཏྤ་ལ་སྔོན་པོ་དང་རུ་རྟ་དང་ཙནྡན་དག་གཅིག་ཏུ་བྱས་ཏེ།
en: “The sādhana of collyrium. “If one wants to perform this sādhana, one should blend together antimony-based collyrium, blue lotuses, costus root, and sandalwood, and place the mixture in a copper vessel.

source: ཟངས་མའི་སྣོད་དུ་གཞག་ལ་ཟླ་བ་གཟས་ཟིན་པའི་དུས་སུ་ཅི་སྲིད་དུ་བ་འཐུལ་བ་དེ་སྲིད་ཀྱི་བར་དུ་བཟླས་པ་བྱའོ། །
en: Then, during a lunar eclipse, one should recite the mantra until the mixture emits smoke.

source: དེ་ནས་མིག་ལ་བསྐུས་ན་མི་སྣང་བར་འགྱུར་ཏེ།
en: One whose eyes are anointed with this preparation will become invisible.

source: ཅི་ལྟར་འདོད་པའི་གཟུགས་དང་མི་སྣང་བར་བྱེད་པ་ཐམས་ཅད་ཀྱི་རྒྱལ་པོར་འགྱུར་རོ། །
en: One will become the king of all those able to disappear at will, oneself being able to assume any form. {26.34}
